dengbaole/stm32_f103_rct6/APP/bsp_i2c_gpio.c
/**
 ******************************************************************************
 * @file    bsp_i2c_ee.c
 * @version V1.0
 * @date    2013-xx-xx
 * @brief   用gpio模拟i2c总线, 适用于STM32系列CPU。该模块不包括应用层命令帧，仅包括I2C总线基本操作函数。
 ******************************************************************************
 * @attention
 *
 * 实验平台:野火 F103-霸道 STM32 开发板
 * 论坛    :http://www.firebbs.cn
 * 淘宝    :https://fire-stm32.taobao.com
 *
 ******************************************************************************
 */

/*
	应用说明：
	在访问I2C设备前，请先调用 i2c_checkdevice() 检测I2C设备是否正常，该函数会配置GPIO

*/
#include "bsp_i2c_gpio.h"
#include "stm32f10x.h"
static uint8_t i2c_temp_buf[32];
static uint8_t i2c_addr;
static uint8_t* i2c_transbuf;
static uint16_t i2c_translens;
static volatile uint16_t i2c_transptr;

/*
*********************************************************************************************************
*	函 数 名: si2c_master_init
*	功能说明: 配置I2C总线的GPIO，采用模拟IO的方式实现
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void si2c_master_init(void) {
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_APB2PeriphClockCmd(EEPROM_RCC_I2C_PORT, ENABLE); /* 打开GPIO时钟 */

	GPIO_InitStructure.GPIO_Pin = EEPROM_I2C_SCL_PIN | EEPROM_I2C_SDA_PIN;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD; /* 开漏输出 */
	GPIO_Init(EEPROM_GPIO_PORT_I2C, &GPIO_InitStructure);

	/* 给一个停止信号, 复位I2C总线上的所有设备到待机模式 */
	si2c_stop();
}

/*
*********************************************************************************************************
*	函 数 名: i2c_delay
*	功能说明: I2C总线位延迟，最快400KHz
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
static void i2c_delay(void) {
	uint8_t i;

	/*　
		下面的时间是通过逻辑分析仪测试得到的。
	工作条件：CPU主频72MHz ，MDK编译环境，1级优化

		循环次数为10时，SCL频率 = 205KHz
		循环次数为7时，SCL频率 = 347KHz， SCL高电平时间1.5us，SCL低电平时间2.87us
		循环次数为5时，SCL频率 = 421KHz， SCL高电平时间1.25us，SCL低电平时间2.375us
	*/
	for (i = 0; i < 10; i++)
		;
}

/*
*********************************************************************************************************
*	函 数 名: si2c_start
*	功能说明: CPU发起I2C总线启动信号
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void si2c_start(void) {
	/* 当SCL高电平时，SDA出现一个下跳沿表示I2C总线启动信号 */
	SDA_OUT_H();
	SCL_OUT_H();
	i2c_delay();
	SDA_OUT_L();
	i2c_delay();
	SCL_OUT_L();
	i2c_delay();
}

/*
*********************************************************************************************************
*	函 数 名: si2c_start
*	功能说明: CPU发起I2C总线停止信号
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void si2c_stop(void) {
	/* 当SCL高电平时，SDA出现一个上跳沿表示I2C总线停止信号 */
	SDA_OUT_L();
	SCL_OUT_H();
	i2c_delay();
	SDA_OUT_H();
}

/*
*********************************************************************************************************
*	函 数 名: si2c_sendbyte
*	功能说明: CPU向I2C总线设备发送8bit数据
*	形    参：_ucByte ： 等待发送的字节
*	返 回 值: 无
*********************************************************************************************************
*/
bool si2c_sendbyte(uint8_t date) {
	uint8_t i;

	/* 先发送字节的高位bit7 */
	for (i = 0; i < 8; i++) {
		if (date & 0x80) {
			SDA_OUT_H();
		} else {
			SDA_OUT_L();
		}
		i2c_delay();
		SCL_OUT_H();
		i2c_delay();
		SCL_OUT_L();
		if (i == 7) {
			SDA_OUT_H(); // 释放总线
		}
		date <<= 1; /* 左移一个bit */
		i2c_delay();
	}
	return si2c_wait_ack();
}

/*
*********************************************************************************************************
*	函 数 名: si2c_readbyte
*	功能说明: CPU从I2C总线设备读取8bit数据
*	形    参：无
*	返 回 值: 读到的数据
*********************************************************************************************************
*/
uint8_t si2c_readbyte(bool isAck) {
	uint8_t i;
	uint8_t receive;

	/* 读到第1个bit为数据的bit7 */
	receive = 0;
	for (i = 0; i < 8; i++) {
		receive <<= 1;
		SCL_OUT_H();
		i2c_delay();
		if (SDA_IN()) {
			receive++;
		}
		SCL_OUT_L();
		i2c_delay();
	}
	if(!isAck) {
		si2c_nack();
	} else {
		si2c_ack();
	}
	return receive;
}

/*
*********************************************************************************************************
*	函 数 名: si2c_wait_ack
*	功能说明: CPU产生一个时钟，并读取器件的ACK应答信号
*	形    参：无
*	返 回 值: 返回0表示正确应答，1表示无器件响应
*********************************************************************************************************
*/
uint8_t si2c_wait_ack(void) {
	uint8_t re;

	SDA_OUT_H(); /* CPU释放SDA总线 */
	i2c_delay();
	SCL_OUT_H(); /* CPU驱动SCL = 1, 此时器件会返回ACK应答 */
	i2c_delay();
	if (SDA_IN()) { /* CPU读取SDA口线状态 */
		re = 1;
	} else {
		re = 0;
	}
	SCL_OUT_L();
	i2c_delay();
	return re;
}

/*
*********************************************************************************************************
*	函 数 名: si2c_ack
*	功能说明: CPU产生一个ACK信号
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void si2c_ack(void) {
	SDA_OUT_L(); /* CPU驱动SDA = 0 */
	i2c_delay();
	SCL_OUT_H(); /* CPU产生1个时钟 */
	i2c_delay();
	SCL_OUT_L();
	i2c_delay();
	SDA_OUT_H(); /* CPU释放SDA总线 */
}

/*
*********************************************************************************************************
*	函 数 名: si2c_nack
*	功能说明: CPU产生1个NACK信号
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void si2c_nack(void) {
	SDA_OUT_H(); /* CPU驱动SDA = 1 */
	i2c_delay();
	SCL_OUT_H(); /* CPU产生1个时钟 */
	i2c_delay();
	SCL_OUT_L();
	i2c_delay();
}

void si2c_write_to(uint8_t addr, uint8_t* array, uint16_t len) {
	uint16_t i = 0;
	i2c_addr = addr;
	i2c_transptr = 0;
	i2c_translens = len;
	i2c_transbuf = array;

	si2c_start();
	if(si2c_sendbyte(i2c_addr & 0xFE) == false) {
		return;
	}
	for(i = 0; i < i2c_translens; i++) {
		if(si2c_sendbyte(i2c_transbuf[i2c_transptr++]) == false) {
			return;
		}
	}
	si2c_stop();
}

void si2c_read_from(uint8_t addr, uint8_t* array, uint16_t len) {
	uint16_t i = 0;
	i2c_addr = addr;
	i2c_transptr = 0;
	i2c_translens = len;
	i2c_transbuf = array;

	si2c_start();
	if(si2c_sendbyte(i2c_addr & 0xFE) == false) {
		return;
	}
	if(si2c_sendbyte(i2c_transbuf[i2c_transptr++]) == false) {
		return;
	}
	si2c_start();
	if(si2c_sendbyte(i2c_addr | 0x01) == false) {
		return;
	}
	for(i = 0; i < i2c_translens - 2; i++) {
		i2c_transbuf[i2c_transptr++] = si2c_readbyte(true);
	}
	i2c_transbuf[i2c_transptr++] = si2c_readbyte(false);
	si2c_stop();
}

void si2c_write_buf_to(uint8_t addr, uint8_t* array, uint16_t len) {
	memcpy(i2c_temp_buf, array, len);
	si2c_write_to(addr, i2c_temp_buf, len);
}
/*
*********************************************************************************************************
*	函 数 名: i2c_checkdevice
*	功能说明: 检测I2C总线设备，CPU向发送设备地址，然后读取设备应答来判断该设备是否存在
*	形    参：_Address：设备的I2C总线地址
*	返 回 值: 返回值 0 表示正确， 返回1表示未探测到
*********************************************************************************************************
*/
uint8_t i2c_checkdevice(uint8_t _Address) {
	uint8_t ucAck;

	si2c_start(); /* 发送启动信号 */
	/* 发送设备地址+读写控制bit（0 = w， 1 = r) bit7 先传 */
	ucAck = si2c_sendbyte(_Address | EEPROM_I2C_WR); /* 检测设备的ACK应答(0表示应答，1表示无应答) */

	si2c_stop(); /* 发送停止信号 */

	return ucAck;
}
